tutorials/StagDrop/interStagDropLa12000/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {      
/*
	reconstructionScheme isoAlpha;

        // isoAdvector parameters
        isoFaceTol      1e-6;
        surfCellTol     1e-6;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;
        gradAlphaNormal false;
*/

        // MULES parameters
        nAlphaCorr      2;
        cAlpha          1;
        icAlpha         0;
        MULESCorr       yes;
        nLimiterIter    3;
        alphaApplyPrevCorr yes;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;

        // parameters read by both isoAdvector and MULES
        nAlphaSubCycles 1;
    }

    pcorr
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-9;
        relTol          0.01;
        //maxIter         100;
	//smoother        DICGaussSeidel;
	    nPreSweeps      0;
	    nPostSweeps     2;
	    nFinestSweeps   2;
	    cacheAgglomeration true;
	    nCellsInCoarsestLevel 10;
	    agglomerator    faceAreaPair;
	    mergeLevels     1;
    }

    pcorrFinal
    {
        $pcorr;
	tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        $pcorr;
        tolerance       1e-07;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-08;
        relTol          0;
    }

    U
    {
        solver PBiCGStab; 
	preconditioner DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(U)Final"
    {
        $U;
	tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
	consistent yes;
	correctPhi yes;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*" 1;
    }
}
// ************************************************************************* //
